# Real Estate Listings on ReMax and Walk Score

In [1]:
import pandas as pd
import numpy as np
import requests
from bs4 import BeautifulSoup
import time
from splinter import Browser
from sqlalchemy import create_engine
import warnings
warnings.filterwarnings('ignore')
print('Libraries imported!')

Libraries imported!

# Toronto

In [4]:
house_address = []
house_details = []

base_url = 'https://www.remax.ca/on/toronto-real-estate?page='
urls = [base_url + str(x) for x in range(1,301)]

for url in urls:
    # Parse HTML with Beautiful Soup
    time.sleep(5)
    response = requests.get(url)
    soup = BeautifulSoup(response.text, 'html.parser')

    try:
        addresses = soup.find_all('div', class_='left-content flex-one')
        for address in addresses:
            house_address.append(address.text)
    except:
        house_address.append('N/A')
        
    try:
        details = soup.find_all('div', class_='property-details')
        for detail in details:
            house_details.append(detail.text)
    except:
        house_details.append('N/A')

In [5]:
address_df = pd.DataFrame(house_address)

new_df = address_df[0].str.split(' ', 2, expand=True)
new_df["price"] = new_df[1].str.replace("$", "")
new_df["price"] = new_df["price"].str.replace(",", "")
new_df["price"] = pd.to_numeric(new_df["price"])

del new_df[0]
del new_df[1]
new_df.head()

                                                2   price
0       318 - 825 CHURCH ST, Toronto, ON, M4W 3Z4    2280
1    1206 - 170 BAYVIEW AVE, Toronto, ON, M5A 0M4  399999
2     531 - 25 BAMBURGH CIR, Toronto, ON, M1W 3W2  590000
3  511 - 70 FOREST MANOR RD, Toronto, ON, M2J 0A9    1950
4      2502 - 8 COLBORNE ST, Toronto, ON, M5E 1E1    1900

In [6]:
new_df["price"].dtype

dtype('int64')

In [7]:
final_df = new_df[2].str.split(', Toronto, ON, ', expand=True)
final_df.head()

                          0        1
0       318 - 825 CHURCH ST  M4W 3Z4
1    1206 - 170 BAYVIEW AVE  M5A 0M4
2     531 - 25 BAMBURGH CIR  M1W 3W2
3  511 - 70 FOREST MANOR RD  M2J 0A9
4      2502 - 8 COLBORNE ST  M5E 1E1

In [8]:
df_add = pd.concat([new_df, final_df], axis=1)
del df_add[2]
df_add.columns = ["price", "address", "postal_code"]
df_add.head()

    price                   address postal_code
0    2280       318 - 825 CHURCH ST     M4W 3Z4
1  399999    1206 - 170 BAYVIEW AVE     M5A 0M4
2  590000     531 - 25 BAMBURGH CIR     M1W 3W2
3    1950  511 - 70 FOREST MANOR RD     M2J 0A9
4    1900      2502 - 8 COLBORNE ST     M5E 1E1

In [9]:
details = pd.DataFrame(house_details)

details_df = details[0].str.split('|', expand=True)

del details_df[2]

details_df.columns = ["bedrooms", "bath", "property_type"]
details_df.head()

    bedrooms    bath property_type
0  1 + 1 bed  1 bath          None
1      1 bed  1 bath         condo
2  2 + 1 bed  2 bath         condo
3      2 bed  1 bath          None
4      1 bed  1 bath          None

In [10]:
toronto_df_dup = pd.concat([df_add, details_df], axis=1)
toronto_df = toronto_df_dup.drop_duplicates()
toronto_df.head()

,price,address,postal_code,bedrooms,bath,property_type
0,2280,318 - 825 CHURCH ST,M4W 3Z4,1 + 1 bed,1 bath,None
1,399999,1206 - 170 BAYVIEW AVE,M5A 0M4,1 bed,1 bath,condo
2,590000,531 - 25 BAMBURGH CIR,M1W 3W2,2 + 1 bed,2 bath,condo
3,1950,511 - 70 FOREST MANOR RD,M2J 0A9,2 bed,1 bath,None
4,1900,2502 - 8 COLBORNE ST,M5E 1E1,1 bed,1 bath,None

In [11]:
toronto_df.to_csv('toronto_df.csv', index=False)

----------------

### Walk Score

In [12]:
toronto_df = pd.read_csv('toronto_df.csv')
toronto_df.head()

,price,address,postal_code,bedrooms,bath,property_type
0,2280,318 - 825 CHURCH ST,M4W 3Z4,1 + 1 bed,1 bath,NaN
1,399999,1206 - 170 BAYVIEW AVE,M5A 0M4,1 bed,1 bath,condo
2,590000,531 - 25 BAMBURGH CIR,M1W 3W2,2 + 1 bed,2 bath,condo
3,1950,511 - 70 FOREST MANOR RD,M2J 0A9,2 bed,1 bath,NaN
4,1900,2502 - 8 COLBORNE ST,M5E 1E1,1 bed,1 bath,NaN

In [13]:
post_code_list = []

for i in toronto_df["postal_code"]:
    post_code_list.append(i)

In [ ]:
scores_walk = []
scores_bike = []
scores_transit = []

for i in post_code_list:

    try:
        postal_code = i.replace(" ", "%20")
        url_score = "https://www.walkscore.com/score/" + str(postal_code)
        time.sleep(5)

        # Parse HTML with Beautiful Soup
        response = requests.get(url_score)
        code_soup = BeautifulSoup(response.text, 'html.parser')

        if 'pp.walk.sc/badge/walk/score' in str(code_soup):
            ws = str(code_soup).split('pp.walk.sc/badge/walk/score/')[1][:2].replace('.','')
            scores_walk.append(ws)
        else:
            ws = 'N/A'
            scores_walk.append(ws)
        if 'pp.walk.sc/badge/bike/score' in str(code_soup):
            bs = str(code_soup).split('pp.walk.sc/badge/bike/score/')[1][:2].replace('.','')
            scores_bike.append(bs)
        else:
            bs = 'N/A'
            scores_bike.append(bs)
        if 'pp.walk.sc/badge/transit/score' in str(code_soup):
            ts = str(code_soup).split('pp.walk.sc/badge/transit/score/')[1][:2].replace('.','')
            scores_transit.append(ts)
        else:
            ts = 'N/A'
            scores_transit.append(ts)
    except:
        ws = 'N/A'
        scores_walk.append(ws)
        bs = 'N/A'
        scores_bike.append(bs)
        ts = 'N/A'
        scores_transit.append(ts)

In [14]:
score_df_trans = {'postal_code':post_code_list, 
                  'walk_score':scores_walk, 
                  'bike_score':scores_bike, 
                  'transit_score':scores_transit}
score_df_dup = pd.DataFrame(score_df_trans)
score_df = score_df_dup.drop_duplicates()
score_df.head()

  postal_code walk_score bike_score transit_score
0     T2V 1M4         58         61            55
1     T2V 2G9         57         75            57
2     T2T 4L7         38         82            38
3     T2M 1C2         77         86            56
4     T2Y 2V4         19         60            45

In [15]:
score_df.to_csv('score_df_tor.csv', index=False)

-------------------

# PostgreSQL

In [16]:
toronto_df = pd.read_csv('toronto_df.csv')
score_df = pd.read_csv('score_df_tor.csv')

In [17]:
rds_connection_string = "postgres:1@localhost:5432/realestate_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

toronto_df.to_sql(name= "toronto_df", con=engine, if_exists="replace", index=False)
score_df.to_sql(name= "score_df_tor", con=engine, if_exists="replace", index=False)

In [18]:
# import pymongo
# from pymongo import MongoClient

In [19]:
# toronto_df_html = toronto_df.to_html()
# score_df_tor_html = score_df_tor.to_html()

# MongoDB

In [20]:
import pymongo
from pymongo import MongoClient

conn = 'mongodb://localhost:27017'
# Making a Connection with MongoClient
client = MongoClient(conn)
# database
db = client.realestate_db

collection = db.toronto
toronto_dict = toronto_df.to_dict("records")
collection.insert_many(toronto_dict)

collection = db.score
score_dict = score_df.to_dict("records")
collection.insert_many(score_dict)

# MySQL

In [ ]:
engine = create_engine(f'mysql+pymysql://root:{password}@localhost/realestate_db', pool_recycle=3600)

calgary_df.to_sql(name="calgary", con=engine, if_exists="append", index=False)
score_df.to_sql(name="score", con=engine, if_exists="append", index=False)